app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "genre", "published_year", "created_at", "updated_at") VALUES ('The Great Gatsby', 'F. Scott Fitzgerald', 'Fiction', 1925, '2026-04-02 14:16:05.572128', '2026-04-02 14:16:05.572128') RETURNING "id"
---
  def create
    @book = Book.new(book_params)

    if @book.save

UPDATE "books" SET "published_year" = 1926, "updated_at" = '2026-04-02 14:16:05.762703' WHERE "books"."id" = 1
---
  def update
    if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = 2
---
  def destroy
    @book.destroy!

SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
---
    def set_book
      @book = Book.find(params.expect(:id))